In [20]:
import pandas as pd

In [21]:
unique_titles = pd.read_csv('data/unique_titles.csv')

In [22]:
unique_titles_df = pd.DataFrame(unique_titles)

In [23]:
unique_titles_df.head(10)

   emp_no first_name last_name            title
0   10001     Georgi   Facello  Senior Engineer
1   10004  Chirstian   Koblick  Senior Engineer
2   10005    Kyoichi  Maliniak     Senior Staff
3   10006     Anneke   Preusig  Senior Engineer
4   10009     Sumant      Peac  Senior Engineer
5   10011       Mary     Sluis            Staff
6   10018   Kazuhide      Peha  Senior Engineer
7   10019    Lillian   Haddadi            Staff
8   10020     Mayuko   Warwick         Engineer
9   10022     Shahaf    Famili         Engineer

In [24]:
retiring_titles = pd.read_csv('data/retiring_titles.csv')

In [25]:
retiring_titles_df = pd.DataFrame(retiring_titles)

In [26]:
retiring_titles_df

   count               title
0  29414     Senior Engineer
1  28254        Senior Staff
2  14222            Engineer
3  12243               Staff
4   4502    Technique Leader
5   1761  Assistant Engineer
6      2             Manager

In [27]:
retiring_titles_df.sum()

count                                                90398
title    Senior EngineerSenior StaffEngineerStaffTechni...
dtype: object

In [28]:
retiring_titles_df.mean()

count    12914.0
dtype: float64

In [29]:
mentorship = pd.read_csv('data/mentorship_eligibility.csv')

In [30]:
mentorship_df = pd.DataFrame(mentorship)

In [31]:
mentorship_df.head(5)

,emp_no,first_name,last_name,birth_date,from_date,to_date,title
0,10095,Hilari,Morton,1965-01-03,1994-03-10,9999-01-01,Staff
1,10122,Ohad,Esposito,1965-01-19,1998-08-06,9999-01-01,Technique Leader
2,10291,Dipayan,Seghrouchni,1965-01-23,1987-03-30,9999-01-01,Staff
3,10476,Kokou,Iisaka,1965-01-01,1987-09-20,9999-01-01,Staff
4,10663,Teunis,Noriega,1965-01-09,1999-02-12,9999-01-01,Technique Leader

In [32]:
mentorship_df.count()

emp_no        1549
first_name    1549
last_name     1549
birth_date    1549
from_date     1549
to_date       1549
title         1549
dtype: int64

In [39]:
(90398 - 1549)

88849

In [41]:
90398/1549

58.35894125242092